---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DividedSurfacePatternFillMaterial
source: html/52ba450e-157d-79e4-61cc-024a070de2b0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DividedSurfacePatternFillMaterial Property

"Pattern Fill Material"

## Syntax (C#)
```csharp
public static ForgeTypeId DividedSurfacePatternFillMaterial { get; }
```